src/InformationRegisters/ДокументыФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ДокументыФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Серия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Номер</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>14</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДатаВыдачи</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействия</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КемВыдан</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодПодразделения</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>15</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЯвляетсяДокументомУдостоверяющимЛичность</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Физлицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ВидыДокументовФизическихЛиц</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/InformationRegisters/ДокументыФизическихЛиц/Forms/ФормаЗаписи/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
// Процедура, обработчик события "ПриСозданииНаСервере".
//
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если ЗначениеЗаполнено(Запись.Физлицо) И ТипЗнч(Запись.Физлицо) = Тип("СправочникСсылка.Сотрудники") Тогда
		Элементы.Физлицо.Заголовок = "Сотрудник";
		Элементы.Физлицо.ВыбиратьТип = Ложь;
	КонецЕсли;
	
	
	Если ЗначениеЗаполнено(Запись.Физлицо) И ТипЗнч(Запись.Физлицо) = Тип("СправочникСсылка.Контрагенты") Тогда
		Элементы.Физлицо.Заголовок = "Контрагент";
		Элементы.Физлицо.ВыбиратьТип = Ложь;
	КонецЕсли;
	
	Если Параметры.Свойство("Контрагент") И ЗначениеЗаполнено(Параметры.Контрагент) Тогда
		
		Запись.Физлицо = Параметры.Контрагент;
		Элементы.Физлицо.ТолькоПросмотр = Истина;
		
	КонецЕсли;
	
	ЗаполнитьСписокВыбораВидаДокумента();
	
КонецПроцедуры

&НаСервере
// Процедура, обработчик события "ПередЗаписьюНаСервере".
//
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	ЗаписьДокумента = РегистрыСведений.ДокументыФизическихЛиц.СоздатьМенеджерЗаписи();
	ЗаписьДокумента.Физлицо = ТекущийОбъект.ФизЛицо;
	ЗаписьДокумента.ВидДокумента = ТекущийОбъект.ВидДокумента;
	ЗаписьДокумента.Прочитать();
	
	Если НЕ ЗаписьДокумента <> Неопределено Тогда
		Отказ = Истина;
		ОбщегоНазначенияКлиентСервер.СообщитьПользователю("Данная запись уже существует!");
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
// Процедура, обработчик команды "ЗаписатьИЗакрыть".
//
Процедура ЗаписатьИЗакрыть(Команда)
	
	ЭтаФорма.Записать();
	Закрыть();
	Оповестить("ОбновленыУдостоверения");

КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовШапкиФормы

&НаКлиенте
// Процедура, обработчик события "ПриИзменении".
//
Процедура ВидДокументаПриИзменении(Элемент)
	
	Если ЯвляетсяУдостоверениемЛичности(Запись.Физлицо, Запись.ВидДокумента) Тогда
		Запись.ЯвляетсяДокументомУдостоверяющимЛичность = Истина;
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервереБезКонтекста
// Функция, возвращает булево значение ресурса регистра.
//
Функция ЯвляетсяУдостоверениемЛичности(Физлицо, ВидДокумента)
	
	Возврат РегистрыСведений.ДокументыФизическихЛиц.ЯвляетсяУдостоверениемЛичности(Физлицо, ВидДокумента);
	
КонецФункции

&НаСервере
// Процедура - Заполнить список выбора вида документа
//
Процедура ЗаполнитьСписокВыбораВидаДокумента()
	
	Элементы.ВидДокумента.СписокВыбора.Очистить();
	СписокВыбора = Справочники.ВидыДокументовФизическихЛиц.ПолучитьМассивВидов();
	Для каждого Вид Из СписокВыбора Цикл
	
		Элементы.ВидДокумента.СписокВыбора.Добавить(Вид);
	
	КонецЦикла;
	
КонецПроцедуры 


#КонецОбласти
